

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Расход
	Движения.Расход.Записывать = Истина;
	Для Каждого ТекСтрокаТаблицаЗаказ Из ТаблицаЗаказ Цикл
		Движение = Движения.Расход.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТаблицаЗаказ.Номенклатура;
		Движение.Количество = ТекСтрокаТаблицаЗаказ.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

