&НаСервере
Функция ПолучитьЦенуНоменклатурыПоставщика(Номенклатура)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныПоставщиков.Номенклатура КАК Номенклатура,
	               |	ЦеныПоставщиков.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныПоставщиков КАК ЦеныПоставщиков
	               |ГДЕ
	               |	ЦеныПоставщиков.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить().Выгрузить();
	ЦенаНоменклатуры = Результат.Получить(0).Цена; 
	
	Возврат ЦенаНоменклатуры 
КонецФункции   

&НаСервере
Функция ПолучитьНоменклатуруПоставщика(Поставщик)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныПоставщиков.Поставщик КАК Поставщик,
	               |	ЦеныПоставщиков.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ЦеныПоставщиков КАК ЦеныПоставщиков
	               |ГДЕ
	               |	ЦеныПоставщиков.Поставщик = &Поставщик";
	
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	
	Результат = Запрос.Выполнить().Выгрузить();
	НоменклатураПоставщика = Результат.Получить(0).Номенклатура; 
	
	Возврат НоменклатураПоставщика
КонецФункции

&НаСервере
Функция ПолучитьЦенуНоменклатурыНашей(Номенклатура)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныТоваров.Номенклатура КАК Номенклатура,
	               |	ЦеныТоваров.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦенаТоваров КАК ЦеныТоваров
	               |ГДЕ
	               |	ЦеныТоваров.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить().Выгрузить();
	ЦенаНоменклатуры = Результат.Получить(0).Цена; 
	
	Возврат ЦенаНоменклатуры 
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПоставщикаПриИзменении(Элемент)
	// Получение цены номенклатуры поставщика
	Стр = Элементы.Товары.ТекущиеДанные;
	ЦенаПоставщика = ПолучитьЦенуНоменклатурыПоставщика(Стр.НоменклатураПоставщика);
	Стр.ЦенаПоставщика = ЦенаПоставщика;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПоставщикПриИзменении(Элемент)
	// Получение номенклатуры поставщика
	Стр = Элементы.Товары.ТекущиеДанные;
	НоменклатураПоставщика = ПолучитьНоменклатуруПоставщика(Стр.Поставщик);
	Стр.НоменклатураПоставщика = НоменклатураПоставщика;
	
	// Получение цены номенклатуры поставщика, при изменении поставщика
	ЦенаПоставщика = ПолучитьЦенуНоменклатурыПоставщика(Стр.НоменклатураПоставщика);
	Стр.ЦенаПоставщика = ЦенаПоставщика;
	Стр.РазницаЦен = Стр.ЦенаПоставщика - Стр.ЦенаНаша;
КонецПроцедуры 

&НаКлиенте
Процедура ТоварыЗаказаКоличествоПриИзменении(Элемент)
	Стр = Элементы.ТоварыЗаказа.ТекущиеДанные;
	Стр.Сумма = Стр.Количество * Стр.Цена;  
	// НДС
	Если Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС10") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.1
	ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС18") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.18
	Иначе Стр.СтавкаНДС = 0
	КонецЕсли;   
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказаЦенаПриИзменении(Элемент)
	Стр = Элементы.ТоварыЗаказа.ТекущиеДанные;
	Стр.Сумма = Стр.Количество * Стр.Цена;  
	// НДС
	Если Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС10") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.1 + Стр.Сумма
	ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС18") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.18 + Стр.Сумма
	ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС0") Тогда
		Стр.СуммаНДС = 0	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказаСтавкиНДСПриИзменении(Элемент)
	Стр = Элементы.ТоварыЗаказа.ТекущиеДанные;
	Стр.Сумма = Стр.Количество * Стр.Цена;  
	// НДС
	Если Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС10") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.1 + Стр.Сумма
	ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС18") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.18 + Стр.Сумма
	ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС0") Тогда
		Стр.СуммаНДС = 0	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказаНоменклатураПриИзменении(Элемент)
	Стр = Элементы.ТоварыЗаказа.ТекущиеДанные;
	ЦенаПоставщика = ПолучитьЦенуНоменклатурыПоставщика(Стр.Номенклатура);
	Стр.ЦенаПоставщика = ЦенаПоставщика;  
	
	Цена = ПолучитьЦенуНоменклатурыНашей(Стр.Номенклатура);
	Стр.Цена = Цена;           
	
	// Наценка поставщика формула, рассчет
	Стр.НаценкаПоставщика = (Стр.ЦенаПоставщика + Стр.Цена) / 100;
	
	Стр.Сумма = Стр.Количество * Стр.Цена;  
	
	// НДС
	Если Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС10") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.1 + Стр.Сумма
	ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС18") Тогда
		Стр.СуммаНДС = Стр.Сумма * 0.18 + Стр.Сумма
	ИначеЕсли Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкаНДС.НДС0") Тогда
		Стр.СуммаНДС = 0	
	КонецЕсли; 
КонецПроцедуры




